import a18n from 'a18n';

export default {
  播放音频: a18n('播放音频'),
  摄像头选择: a18n('摄像头选择'),
  '是否可以清楚的看到自己？': a18n('是否可以清楚的看到自己？'),
  看不到: a18n('看不到'),
  看的到: a18n('看的到'),
  检测报告: a18n('检测报告'),
  正常: a18n('正常'),
  异常: a18n('异常'),
  网络延时: a18n('网络延时'),
  上行网络质量: a18n('上行网络质量'),
  下行网络质量: a18n('下行网络质量'),
  重新检测: a18n('重新检测'),
  完成检测: a18n('完成检测'),
  '1. 若浏览器弹出提示，请选择“允许”<br>': a18n(
    '1. 若浏览器弹出提示，请选择“允许”<br>'
  ),
  '2. 若杀毒软件弹出提示，请选择“允许”<br>': a18n(
    '2. 若杀毒软件弹出提示，请选择“允许”<br>'
  ),
  '3. 检查系统设置，允许浏览器访问摄像头及麦克风<br>': a18n(
    '3. 检查系统设置，允许浏览器访问摄像头及麦克风<br>'
  ),
  '4. 检查浏览器设置，允许网页访问摄像头及麦克风<br>': a18n(
    '4. 检查浏览器设置，允许网页访问摄像头及麦克风<br>'
  ),
  '5. 检查摄像头/麦克风是否正确连接并开启<br>': a18n(
    '5. 检查摄像头/麦克风是否正确连接并开启<br>'
  ),
  '6. 尝试重新连接摄像头/麦克风<br>': a18n('6. 尝试重新连接摄像头/麦克风<br>'),
  '7. 尝试重启设备后重新检测': a18n('7. 尝试重启设备后重新检测'),
  '1. 请检查设备是否联网<br>': a18n('1. 请检查设备是否联网<br>'),
  '2. 请刷新网页后再次检测<br>': a18n('2. 请刷新网页后再次检测<br>'),
  '3. 请尝试更换网络后再次检测': a18n('3. 请尝试更换网络后再次检测'),
  '连接出错，请重试': a18n('连接出错，请重试'),
  '设备%s连接成功，请开始设备检测': a18n('设备%s连接成功，请开始设备检测'),
  及网络: a18n('及网络'),
  '未检测到%1%2%3设备，请检查设备连接': a18n(
    '未检测到%1%2%3设备，请检查设备连接'
  ),
  '【摄像头】': a18n('【摄像头】'),
  '【麦克风】': a18n('【麦克风】'),
  '【扬声器】': a18n('【扬声器】'),
  '请允许浏览器及网页访问摄像头/麦克风设备': a18n(
    '请允许浏览器及网页访问摄像头/麦克风设备'
  ),
  '请允许浏览器及网页访问摄像头/麦克风设备，并检查网络连接': a18n(
    '请允许浏览器及网页访问摄像头/麦克风设备，并检查网络连接'
  ),
  '网络连接失败，请检查网络连接': a18n('网络连接失败，请检查网络连接'),
  设备连接: a18n('设备连接'),
  '设备检测前请确认设备连接了%1%2%3%4': a18n(
    '设备检测前请确认设备连接了%1%2%3%4'
  ),
  摄像头: a18n('摄像头'),
  '、麦克风': a18n('、麦克风'),
  '、扬声器': a18n('、扬声器'),
  和网络: a18n('和网络'),
  '设备正在连接中，请稍后': a18n('设备正在连接中，请稍后'),
  开始检测: a18n('开始检测'),
  重新连接: a18n('重新连接'),
  跳过检测: a18n('跳过检测'),
  麦克风选择: a18n('麦克风选择'),
  '对着麦克风说"哈喽"试试～': a18n('对着麦克风说 哈喽 试试～'),
  '是否可以看到音量图标跳动？': a18n('是否可以看到音量图标跳动？'),
  操作系统: a18n('操作系统'),
  浏览器: a18n('浏览器'),
  是否支持TRTC: a18n('是否支持TRTC'),
  是否支持屏幕分享: a18n('是否支持屏幕分享'),
  支持: a18n('支持'),
  不支持: a18n('不支持'),
  '剩余检测时间（%s）s': a18n('剩余检测时间（%s）s'),
  查看检测报告: a18n('查看检测报告'),
  扬声器选择: a18n('扬声器选择'),
  '请调高设备音量，点击播放下面的音频试试～': a18n(
    '请调高设备音量，点击播放下面的音频试试～'
  ),
  '是否可以听到声音？': a18n('是否可以听到声音？'),
  听不到: a18n('听不到'),
  听的到: a18n('听的到'),
  未知: a18n('未知'),
  极佳: a18n('极佳'),
  较好: a18n('较好'),
  一般: a18n('一般'),
  差: a18n('差'),
  极差: a18n('极差'),
  断开: a18n('断开'),

  '暂时无法访问摄像头/麦克风，请确保系统授予当前浏览器摄像头/麦克风权限，并且没有其他应用占用摄像头/麦克风':
    a18n(
      '暂时无法访问摄像头/麦克风，请确保系统授予当前浏览器摄像头/麦克风权限，并且没有其他应用占用摄像头/麦克风'
    ),
  '用户/系统已拒绝授权访问摄像头或麦克风': a18n(
    '用户/系统已拒绝授权访问摄像头或麦克风'
  ),
  找不到摄像头或麦克风设备: a18n('找不到摄像头或麦克风设备'),
  '采集属性设置错误，如果您指定了 cameraId/microphoneId，请确保它们是一个有效的非空字符串':
    a18n(
      '采集属性设置错误，如果您指定了 cameraId/microphoneId，请确保它们是一个有效的非空字符串'
    ),
  '初始化本地流时遇到未知错误, 请重试':
    a18n('初始化本地流时遇到未知错误, 请重试'),
};
